C = [list(map(int, input().split())) for _ in range(3)]

# 矛盾していないか(列同士、行同士の差が同じか)
ok = True

# 0列目と1列目の差が各行同じか
if C[0][0] - C[0][1] != C[1][0] - C[1][1] or C[1][0] - C[1][1] != C[2][0] - C[2][1]:
    ok = False
    
# 1列目と2列目の差が各行同じか
if C[0][1] - C[0][2] != C[1][1] - C[1][2] or C[1][1] - C[1][2] != C[2][1] - C[2][2]:
    ok = False

# 0行目と1行目の差が各行同じか
if C[0][0] - C[1][0] != C[0][1] - C[1][1] or C[0][1] - C[1][1] != C[0][2] - C[1][2]:
    ok = False

# 1行目と2行目の差が各行同じか
if C[1][0] - C[2][0] != C[1][1] - C[2][1] or C[1][1] - C[2][1] != C[1][2] - C[2][2]:
    ok = False
    
if ok:
    print("Yes")
else:
    print("No")